# 1. Из списка создать словарь
lst = [45, 12, 67, 88, 89, 59, 45, 34, 33, 90, 78, 12, 11, 23, 34, 45, 66, 77, 77, 88, 99, 100, 89, 43, 42, 21, 64, 68, 51, 92, 85]
print({index:value for index,value in enumerate(lst)})
print("#############################################")

# 2.
n = int(input('Угадай число: '))
if n < 1:
    print('Слишком мало')
elif n <= 1 or n <= 20:
    print('Класс! Вы угадали')
elif 20 < n:
    print('Слишком много')    
else:
    print('Все, вы не выиграли. Игра завершилась')
print('############################################')


# 3. 
some_string = "Adverts"
print(some_string[2:5])
print("#############################################")

